example-rails-app/app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(:page => params[:page], :per_page => 5)
---
SELECT * FROM "articles" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "articles"

  def show
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)