example-rails-app/app/controllers/erb/articles_controller.rb

SELECT * FROM "articles" LIMIT 30 OFFSET 0
---
  def index
    @articles = Article.paginate(:page => params[:page])